In [3]:
import sqlite3
import pandas as pd
conn = sqlite3.connect("C:\\Users\\pragna.nunna_jindals\\Documents\\DataAnalysis\\Data Folder\\QUIZZ\\haunted_house_escape.db")

In [4]:
# see all the tables in dataset
pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", conn)

           name
0        ghosts
1     portraits
2         meals
3       authors
4         books
5         rooms
6   experiments
7    tombstones
8        chimes
9          keys
10        locks
11     attempts

In [5]:
# load a spectific (ghosts) table
df = pd.read_sql_query("SELECT * FROM ghosts", conn)
df.head()

          name  year_died  favorite_number haunting_room
0      Banshee       1615               89     Graveyard
1  Bartholomew       1975               41      Entryway
2     Beatrice       1607               56      Entryway
3       Casper       1654               13    Laboratory
4      Lucinda       1892                8     Graveyard

In [29]:
# Path to your SQLite DB
sqlite_file = r"C:\Users\pragna.nunna_jindals\Documents\DataAnalysis\Data Folder\QUIZZ\haunted_house_escape.db"

# Connect
sqlite_conn = sqlite3.connect(sqlite_file)

In [30]:
# Get list of tables
tables = sqlite_conn.execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()
tables = [t[0] for t in tables]
print("Tables in SQLite:", tables)

Tables in SQLite: ['ghosts', 'portraits', 'meals', 'authors', 'books', 'rooms', 'experiments', 'tombstones', 'chimes', 'keys', 'locks', 'attempts']

In [31]:
import sqlalchemy as sal
engine = sal.create_engine('postgresql://postgres:5599@localhost:5432/haunted_house_escape')
conn = engine.connect()
# database is created in pgAdmin

In [32]:
for table in tables:
    # Read table from SQLite
    df = pd.read_sql(f'SELECT * FROM {table}', sqlite_conn)
    
    # Write to PostgreSQL (replace if table exists)
    df.to_sql(table, engine, if_exists='replace', index=False)
    
    print(f"Table '{table}' transferred successfully!")

Table 'ghosts' transferred successfully!
Table 'portraits' transferred successfully!
Table 'meals' transferred successfully!
Table 'authors' transferred successfully!
Table 'books' transferred successfully!
Table 'rooms' transferred successfully!
Table 'experiments' transferred successfully!
Table 'tombstones' transferred successfully!
Table 'chimes' transferred successfully!
Table 'keys' transferred successfully!
Table 'locks' transferred successfully!
Table 'attempts' transferred successfully!

In [46]:
df_ghosts = pd.read_sql_query("SELECT * FROM ghosts", conn)
df_ghosts.head()

          name  year_died  favorite_number haunting_room
0      Banshee       1615               89     Graveyard
1  Bartholomew       1975               41      Entryway
2     Beatrice       1607               56      Entryway
3       Casper       1654               13    Laboratory
4      Lucinda       1892                8     Graveyard
5     Mortimer       1871               76       Library
6    Balthazar       1964               71       Library
7     Gertrude       1689               85       Library
8        Benny       1647               98    Laboratory
9      Belinda       1825               30     Graveyard

In [34]:
df_portraits = pd.read_sql_query("Select * from portraits", conn)
df_portraits.head(2)

   portrait_id    subject_name  painted_year  curse_strength
0            1  Lord Blackwood          1743               6
1            2    Lady Crimson          1617              10

In [35]:
df_meals = pd.read_sql_query("Select * from meals", conn)
df_meals.head(2)

   meal_id   course served_to  poison_level
0        1     Soup   Banshee             3
1        2  Dessert    Casper             9

In [36]:
df_authors = pd.read_sql_query("Select * from authors", conn)
df_authors.head(2)

   author_id        name  death_year
0          1   Edgar Woe        1943
1          2  Mary Shade        1755

In [37]:
df_books = pd.read_sql_query("Select * from books", conn)
df_books.head(2)

   book_id                 title  author_id        shelf
0        1  Whispers of the Dead          3  South Shelf
1        2       The Hollow Tome          2    East Wing

In [38]:
df_rooms = pd.read_sql_query("Select * from rooms", conn)
df_rooms.head(2)

   room_id           name
0        1    Alchemy Lab
1        2  Necro Chamber

In [39]:
df_experiments = pd.read_sql_query("Select * from experiments", conn)
df_experiments.head(2)

   id experiment_name  success_rate  room_id
0   1    Experiment_1          0.63        3
1   2    Experiment_2          0.98        1

In [40]:
df_chimes = pd.read_sql_query("Select * from chimes", conn)
df_chimes.head(2)

   chime_id           chime_time  volume
0         1  2025-10-31 01:00:00       4
1         2  2025-10-31 02:00:00       6

In [41]:
df_tombstones = pd.read_sql_query("Select * from tombstones", conn)
df_tombstones.head(2)

       name            epitaph      cause_of_death  year_buried
0  Spirit_1      Gone too soon               curse         1964
1  Spirit_2  Haunts this place  falling chandelier         1828

In [42]:
df_keys = pd.read_sql_query("Select * from keys", conn)
df_keys.head(2)

   key_id material  power_level
0       1     Iron            7
1       2   Silver           68

In [43]:
df_locks = pd.read_sql_query("Select * from locks", conn)
df_locks.head(2)

   lock_id       door_name required_material
0        1   Basement Door              Gold
1        2  Graveyard Gate            Silver

In [44]:
df_attempts = pd.read_sql_query("Select * from attempts", conn)
df_attempts.head(2)

   key_id  lock_id  success
0       1        1        0
1       4        2        1